/**
プログラミング実践Java
オブジェクト指向
練習問題3_2
練習問題3_1のプログラムに対して、以下の修正をしてください。
  自己紹介に以下の文言を追加する
    私の好きな教科は〇〇です。
※〇〇は、以下としてください。
    山田：国語
    田中：数学

コンパイル方法
================
>>> javac SO302_11_Q3_2.java
================

実行例
================
>>> java SO302_11_Q3_2
私の名前は山田です。
A高校の野球部に入っています。
私の好きな教科は国語です。

私の名前は田中です。
A高校のテニス部に入っています。
私の好きな教科は数学です。

私の名前は山田です。
B高校の野球部に入っています。
私の好きな教科は国語です。

私の名前は田中です。
B高校のテニス部に入っています。
私の好きな教科は数学です。

================

*/

public class SO302_11_Q3_2 {
  public static void main(String[] args) {

  }
  
  // 関数の定義
}
