/**
プログラミング実践Java
オブジェクト指向
練習問題1_1
学生を表現するプログラムを作成してください。
ただし、手続き型プログラミングのみを使用し、配列や関数も使用してはいけません。
    私の名前は〇〇です。
    〇〇の〇〇に入っています。
※〇〇は、以下としてください。
    山田：野球部
    田中：テニス部

コンパイル方法
================
>>> javac SO302_11_Q1_1.java
================

実行例
================
>>> java SO302_11_Q1_1
私の名前は山田です。
A高校の野球部に入っています。

私の名前は田中です。
A高校のテニス部に入っています。

私の名前は山田です。
B高校の野球部に入っています。

私の名前は田中です。
B高校のテニス部に入っています。

================

*/

public class SO302_11_Q1_1 {
  public static void main(String[] args) {
    // 高校の情報

    // 学生の情報

    // 自己紹介

    // 高校の情報を再設定

    // 自己紹介
  }
}
